src/docs/plantuml-state-diagram.puml
@startuml
[*] --> State1
State1 -> State2 : Event01
State2 -> State3 : Event02
State3 -> State1 : Event03
State3 --> [*]
@enduml
